<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Assets.car</key>
		<data>
		em3GYppgCAQhbFchXl0P54fHcL4=
		</data>
		<key>Base.lproj/LaunchScreen.storyboardc/01J-lp-oVM-view-Ze5-6b-2t3.nib</key>
		<data>
		qPe05ohPLjCkJ4HRKWfhVF4T4DQ=
		</data>
		<key>Base.lproj/LaunchScreen.storyboardc/Info.plist</key>
		<data>
		n2t8gsDpfE6XkhG31p7IQJRxTxU=
		</data>
		<key>Base.lproj/LaunchScreen.storyboardc/UIViewController-01J-lp-oVM.nib</key>
		<data>
		ZVgM1+KwZcZnwhgaI0F7Bt1ba2c=
		</data>
		<key>Base.lproj/Main.storyboardc/DetectionVC.nib</key>
		<data>
		CzUr+PeNnRpkMxwfYhj+tBwStFg=
		</data>
		<key>Base.lproj/Main.storyboardc/Info.plist</key>
		<data>
		L3DsGtEO1Xnw1YdEJLHMTISX+NU=
		</data>
		<key>Base.lproj/Main.storyboardc/t4i-bQ-nop-view-pvH-1D-323.nib</key>
		<data>
		iO6FhGbm7YVpaWc2NBA/7vQahXU=
		</data>
		<key>Facenet6.mlmodelc/analytics/coremldata.bin</key>
		<data>
		19HvviZNwSIXwp6MTzNKU97S82Q=
		</data>
		<key>Facenet6.mlmodelc/coremldata.bin</key>
		<data>
		WM/dzDeKfgn+r7NgepD7NkpXiHg=
		</data>
		<key>Facenet6.mlmodelc/metadata.json</key>
		<data>
		RapySGNSEPOIqalOkjccMas1Hcc=
		</data>
		<key>Facenet6.mlmodelc/model.espresso.net</key>
		<data>
		JGGjR4Lsr7TKKGlMaZzWwhhfQM4=
		</data>
		<key>Facenet6.mlmodelc/model.espresso.shape</key>
		<data>
		E6gdpYB7ofs5DlIJY8/Z5j6MBTw=
		</data>
		<key>Facenet6.mlmodelc/model.espresso.weights</key>
		<data>
		cToJ2ZZIOog2GukfHJ1IIVLTvNc=
		</data>
		<key>Facenet6.mlmodelc/model/coremldata.bin</key>
		<data>
		ywn4n/q5e9oWqKg072wL3kxD++I=
		</data>
		<key>Facenet6.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>Facenet62.mlmodelc/analytics/coremldata.bin</key>
		<data>
		Shz3Aw+j/FGqgQyvOvkswgU2Fyk=
		</data>
		<key>Facenet62.mlmodelc/coremldata.bin</key>
		<data>
		plZik2nO7ITYnOyu0ak7z3lfziQ=
		</data>
		<key>Facenet62.mlmodelc/metadata.json</key>
		<data>
		2kdeNi5w8pBr1gAWDRYIBxPr2xk=
		</data>
		<key>Facenet62.mlmodelc/model.espresso.net</key>
		<data>
		VU1JZfFgW4oTLpnQM9Lfc7ZzXbM=
		</data>
		<key>Facenet62.mlmodelc/model.espresso.shape</key>
		<data>
		PfgHPehREh7WOjafIb1t0GmPpaM=
		</data>
		<key>Facenet62.mlmodelc/model.espresso.weights</key>
		<data>
		O2iH61Yt0uME3CdsmuASq/M5ikI=
		</data>
		<key>Facenet62.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>Facenet62.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
		<key>Fnet.mlmodelc/analytics/coremldata.bin</key>
		<data>
		xqygsbREAVyzLUMsLcdIH+5mOMQ=
		</data>
		<key>Fnet.mlmodelc/coremldata.bin</key>
		<data>
		c3VRxDOOhNgXEo76HleKzWydSNQ=
		</data>
		<key>Fnet.mlmodelc/metadata.json</key>
		<data>
		BIM9J7WjozVlnX60/8eTcbx4zoc=
		</data>
		<key>Fnet.mlmodelc/model.espresso.net</key>
		<data>
		JGGjR4Lsr7TKKGlMaZzWwhhfQM4=
		</data>
		<key>Fnet.mlmodelc/model.espresso.shape</key>
		<data>
		E6gdpYB7ofs5DlIJY8/Z5j6MBTw=
		</data>
		<key>Fnet.mlmodelc/model.espresso.weights</key>
		<data>
		cToJ2ZZIOog2GukfHJ1IIVLTvNc=
		</data>
		<key>Fnet.mlmodelc/model/coremldata.bin</key>
		<data>
		ywn4n/q5e9oWqKg072wL3kxD++I=
		</data>
		<key>Fnet.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>Fnet128.mlmodelc/analytics/coremldata.bin</key>
		<data>
		3tLNXyXx3JPCSqXfZW3tINxeGuk=
		</data>
		<key>Fnet128.mlmodelc/coremldata.bin</key>
		<data>
		eSIGje1BbrMAfvM0pqa4dTkKyvk=
		</data>
		<key>Fnet128.mlmodelc/metadata.json</key>
		<data>
		fGBBNnXTlS80S/g3PrdpKhJ8zks=
		</data>
		<key>Fnet128.mlmodelc/model.espresso.net</key>
		<data>
		JGGjR4Lsr7TKKGlMaZzWwhhfQM4=
		</data>
		<key>Fnet128.mlmodelc/model.espresso.shape</key>
		<data>
		E6gdpYB7ofs5DlIJY8/Z5j6MBTw=
		</data>
		<key>Fnet128.mlmodelc/model.espresso.weights</key>
		<data>
		cToJ2ZZIOog2GukfHJ1IIVLTvNc=
		</data>
		<key>Fnet128.mlmodelc/model/coremldata.bin</key>
		<data>
		ywn4n/q5e9oWqKg072wL3kxD++I=
		</data>
		<key>Fnet128.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>Headers/LivenessFramework-Swift.h</key>
		<data>
		eOoLoLUW1N5yMTzLKAwyHyLhLQc=
		</data>
		<key>Headers/LivenessFramework.h</key>
		<data>
		f11O+Vv8qG3TdDuazTZgmukYTq8=
		</data>
		<key>Info.plist</key>
		<data>
		JwtkwA6D+qD6AGgc2BYL/G2Zrdo=
		</data>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.abi.json</key>
		<data>
		TYBYR3bcr+FMSxB9uLnjW95E7y8=
		</data>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.private.swiftinterface</key>
		<data>
		D3Smfmt6fY16h2KFUqJUN1oQ4Jc=
		</data>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<data>
		Hc3I9HwO5TH5Brmms+RVmFagqc0=
		</data>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<data>
		D3Smfmt6fY16h2KFUqJUN1oQ4Jc=
		</data>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<data>
		ObXc96gSu3tzM/u1PLhqZ+ZchU4=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		BpaXWODmhn9NG+crxJsl/paOy3Y=
		</data>
		<key>SVC6.mlmodelc/analytics/coremldata.bin</key>
		<data>
		UeIWDtZfkLR3vCQcu7GLCJkSmDQ=
		</data>
		<key>SVC6.mlmodelc/coremldata.bin</key>
		<data>
		YkJjB2JxGpGYiMmsjmQOpEKgVpw=
		</data>
		<key>SVC6.mlmodelc/metadata.json</key>
		<data>
		dFDq5YsQOICyhdAfZv70yVAyNWs=
		</data>
		<key>labels.txt</key>
		<data>
		bAKKgyfG40v3pKp1jhk8sZyBwK0=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Assets.car</key>
		<dict>
			<key>hash2</key>
			<data>
			9JjNMlIb7l0Ab0Pf9j1IpKdC/M4Psyjo8dp23UizyPc=
			</data>
		</dict>
		<key>Base.lproj/LaunchScreen.storyboardc/01J-lp-oVM-view-Ze5-6b-2t3.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			eY2xUL0E7RtfU3K2iDgDvZPqP4IO0GDiuyhJho31nbA=
			</data>
		</dict>
		<key>Base.lproj/LaunchScreen.storyboardc/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			HyVdXMU7Ux4/KalAao30mpWOK/lEPT4gvYN09wf31cg=
			</data>
		</dict>
		<key>Base.lproj/LaunchScreen.storyboardc/UIViewController-01J-lp-oVM.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			VPNjf2cf66XxnoLsT0p/tEi7PPwPsYDwiapXH8jwU+I=
			</data>
		</dict>
		<key>Base.lproj/Main.storyboardc/DetectionVC.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			OWdSj4ULplloA8YR7/NOwoyBsXX8ukc2dNj6JYgl7qE=
			</data>
		</dict>
		<key>Base.lproj/Main.storyboardc/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			deWhPAKdUp2Dis0O7go+AzzG47wbbqlIh1faLM7EDuU=
			</data>
		</dict>
		<key>Base.lproj/Main.storyboardc/t4i-bQ-nop-view-pvH-1D-323.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			XNfu/B7sxEWXIpQQkGTvOFPkH0nBkl7G1NsbJuh3EZc=
			</data>
		</dict>
		<key>Facenet6.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			xqr18fVQtvV9Y27kzOv4U1Nny6stDZAkxj83A734AzE=
			</data>
		</dict>
		<key>Facenet6.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			slFJbR3/9kvNQlc/OglKlpVovl8XavL39U39vyZjChs=
			</data>
		</dict>
		<key>Facenet6.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			sHKXSdZK+dkBGCSCkgdFpEnfcY0A9vrpt6uVEvY9LSg=
			</data>
		</dict>
		<key>Facenet6.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			Q6YDO8zipoYnj5YtnswHG2EpckxSw0Rj9MJrWM0zRxk=
			</data>
		</dict>
		<key>Facenet6.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			5T7cmZiYypemp46zFqYRPPq9vj4lTUWXzgDmc3Wu+Bo=
			</data>
		</dict>
		<key>Facenet6.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			UquFxr/GILvZcjei2cYH3zwKJFTsI75O32RM4NDBi8I=
			</data>
		</dict>
		<key>Facenet6.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			5dyN3LM4GYt7lwcO9RVnniqLVWBb4ulR7mi8PQho7bg=
			</data>
		</dict>
		<key>Facenet6.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			FLkAyi9taVm7X4oSFtv+xBinTeczVrItD9C0+lp8vkw=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			bLveLDw/1dIRMznRbs2lWrcJWyqCyC9A90cyHHQGQ3I=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			IfyxUpCwNyXTG/AGQ0ti6XEzQtZgl/VgZAM13lwCTzY=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			v2DQpaem3PQZEuchuR07MH37YaK17UWEcRYtCq/R7+4=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			PW8oyJ/oS3DLHKh8igf3GAVPwIuES6S7smckoDMiZgs=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			5rqi2FEhGceIwfO8dL7ER7Y2nVUSDOvlOTEWbkJSBms=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
		<key>Fnet.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			tng/bwnlIe9Redh0R6jsEy5l6Vac1G0V0EaU25apmN8=
			</data>
		</dict>
		<key>Fnet.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			/A9gpLlOdqHoGPkY9qd6+O03NR5jLIfCeVRe0znJaxk=
			</data>
		</dict>
		<key>Fnet.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			mFjWei8yyHgbGqLorf/B5r9uoZjjK6yXNSwHDU5bCsg=
			</data>
		</dict>
		<key>Fnet.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			Q6YDO8zipoYnj5YtnswHG2EpckxSw0Rj9MJrWM0zRxk=
			</data>
		</dict>
		<key>Fnet.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			5T7cmZiYypemp46zFqYRPPq9vj4lTUWXzgDmc3Wu+Bo=
			</data>
		</dict>
		<key>Fnet.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			UquFxr/GILvZcjei2cYH3zwKJFTsI75O32RM4NDBi8I=
			</data>
		</dict>
		<key>Fnet.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			5dyN3LM4GYt7lwcO9RVnniqLVWBb4ulR7mi8PQho7bg=
			</data>
		</dict>
		<key>Fnet.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>Fnet128.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			6V3DFIxJhpepZyxo4dafzzwvH+Hy87to0ekWH3lUWbM=
			</data>
		</dict>
		<key>Fnet128.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			mzzJn3iChpnj6tLxtG3i6bjLNgkQN9igSXiHKcOmKWw=
			</data>
		</dict>
		<key>Fnet128.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			MNIGQfeQuXlNLDy6ISRkY0aDKDHChoXULRrVFkyu9eQ=
			</data>
		</dict>
		<key>Fnet128.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			Q6YDO8zipoYnj5YtnswHG2EpckxSw0Rj9MJrWM0zRxk=
			</data>
		</dict>
		<key>Fnet128.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			5T7cmZiYypemp46zFqYRPPq9vj4lTUWXzgDmc3Wu+Bo=
			</data>
		</dict>
		<key>Fnet128.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			UquFxr/GILvZcjei2cYH3zwKJFTsI75O32RM4NDBi8I=
			</data>
		</dict>
		<key>Fnet128.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			5dyN3LM4GYt7lwcO9RVnniqLVWBb4ulR7mi8PQho7bg=
			</data>
		</dict>
		<key>Fnet128.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>Headers/LivenessFramework-Swift.h</key>
		<dict>
			<key>hash2</key>
			<data>
			BCxgOe0m46R7VYiwoi+Fz9xhM3sXMQyq+xYmSDLQZ+A=
			</data>
		</dict>
		<key>Headers/LivenessFramework.h</key>
		<dict>
			<key>hash2</key>
			<data>
			zPFFnOO45XqXOB8BLlAwzwHsOybiPru+wRw3S/SYLqE=
			</data>
		</dict>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.abi.json</key>
		<dict>
			<key>hash2</key>
			<data>
			vKuirr1aE9cIF9SSITx15AhMvGTahMwYOdaVg7dr4xw=
			</data>
		</dict>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.private.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			yG+9HuHkYg04HHfn2jxdxt4NfQ18vLVEaPAwOKeR1OE=
			</data>
		</dict>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			O7qJZG/zfrHkYP4zT1rYog5Az27ApDFfbe1rX6ExOYg=
			</data>
		</dict>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			yG+9HuHkYg04HHfn2jxdxt4NfQ18vLVEaPAwOKeR1OE=
			</data>
		</dict>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			R4uq8I2ixifBKchT5XZYxq8jnhZ7bJCieTo1lyEWHwo=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			oo5cNd787ylu6fsCdko6badgxuL/yFPtzBKPuCcoLxY=
			</data>
		</dict>
		<key>SVC6.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			dC+PUooGSQ5gxNKZcg/UI6B/XJ14nKBMyu9XFABKnzM=
			</data>
		</dict>
		<key>SVC6.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			rlOdRCLEM0RsRe2bQuXFw0MFpJxxhUacI3lmg6f2F/8=
			</data>
		</dict>
		<key>SVC6.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			PpN68Yfc9KrbaqjNP3TmCk0pBClUev+M8iqn6fOL7l8=
			</data>
		</dict>
		<key>labels.txt</key>
		<dict>
			<key>hash2</key>
			<data>
			51YV41fFAsEPyBr0PNexlCldALl1ywZztrpGYdaCCyc=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
