<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Assets.car</key>
		<data>
		r214epQ6at8rD1PHJs3mbJroXX8=
		</data>
		<key>Base.lproj/LaunchScreen.storyboardc/01J-lp-oVM-view-Ze5-6b-2t3.nib</key>
		<data>
		qPe05ohPLjCkJ4HRKWfhVF4T4DQ=
		</data>
		<key>Base.lproj/LaunchScreen.storyboardc/Info.plist</key>
		<data>
		n2t8gsDpfE6XkhG31p7IQJRxTxU=
		</data>
		<key>Base.lproj/LaunchScreen.storyboardc/UIViewController-01J-lp-oVM.nib</key>
		<data>
		ZVgM1+KwZcZnwhgaI0F7Bt1ba2c=
		</data>
		<key>Base.lproj/Main.storyboardc/DetectionVC.nib</key>
		<data>
		CzUr+PeNnRpkMxwfYhj+tBwStFg=
		</data>
		<key>Base.lproj/Main.storyboardc/Info.plist</key>
		<data>
		L3DsGtEO1Xnw1YdEJLHMTISX+NU=
		</data>
		<key>Base.lproj/Main.storyboardc/t4i-bQ-nop-view-pvH-1D-323.nib</key>
		<data>
		iO6FhGbm7YVpaWc2NBA/7vQahXU=
		</data>
		<key>Facenet62.mlmodelc/analytics/coremldata.bin</key>
		<data>
		Shz3Aw+j/FGqgQyvOvkswgU2Fyk=
		</data>
		<key>Facenet62.mlmodelc/coremldata.bin</key>
		<data>
		plZik2nO7ITYnOyu0ak7z3lfziQ=
		</data>
		<key>Facenet62.mlmodelc/metadata.json</key>
		<data>
		2kdeNi5w8pBr1gAWDRYIBxPr2xk=
		</data>
		<key>Facenet62.mlmodelc/model.espresso.net</key>
		<data>
		VU1JZfFgW4oTLpnQM9Lfc7ZzXbM=
		</data>
		<key>Facenet62.mlmodelc/model.espresso.shape</key>
		<data>
		PfgHPehREh7WOjafIb1t0GmPpaM=
		</data>
		<key>Facenet62.mlmodelc/model.espresso.weights</key>
		<data>
		O2iH61Yt0uME3CdsmuASq/M5ikI=
		</data>
		<key>Facenet62.mlmodelc/model/coremldata.bin</key>
		<data>
		yNfQ7w7t+oLS6hqlkoRbmm1LArc=
		</data>
		<key>Facenet62.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
		<key>Headers/LivenessFramework-Swift.h</key>
		<data>
		Go2jQ+Vfu4nQVqQn3YyoJhhGsgk=
		</data>
		<key>Headers/LivenessFramework.h</key>
		<data>
		f11O+Vv8qG3TdDuazTZgmukYTq8=
		</data>
		<key>Info.plist</key>
		<data>
		eq6eNsQXN8SUWvVSXaQY0uhkf04=
		</data>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.abi.json</key>
		<data>
		qZZYIHR/043ZsgniBOthoPuuGI8=
		</data>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.private.swiftinterface</key>
		<data>
		WdTGqeN1yIC4BKEpjgSwETXBapw=
		</data>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<data>
		OMUwByQ6V/QfgnQEXGQwMnaKDzI=
		</data>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<data>
		WdTGqeN1yIC4BKEpjgSwETXBapw=
		</data>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<data>
		j3lahxZ8CPC4qfaaC6dYZohd3QA=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		BpaXWODmhn9NG+crxJsl/paOy3Y=
		</data>
		<key>labels.txt</key>
		<data>
		bAKKgyfG40v3pKp1jhk8sZyBwK0=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Assets.car</key>
		<dict>
			<key>hash2</key>
			<data>
			cBWc9c2sVfhQjzUlX7ekWiV1fvUeXcbu6hk7cQvm3lE=
			</data>
		</dict>
		<key>Base.lproj/LaunchScreen.storyboardc/01J-lp-oVM-view-Ze5-6b-2t3.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			eY2xUL0E7RtfU3K2iDgDvZPqP4IO0GDiuyhJho31nbA=
			</data>
		</dict>
		<key>Base.lproj/LaunchScreen.storyboardc/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			HyVdXMU7Ux4/KalAao30mpWOK/lEPT4gvYN09wf31cg=
			</data>
		</dict>
		<key>Base.lproj/LaunchScreen.storyboardc/UIViewController-01J-lp-oVM.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			VPNjf2cf66XxnoLsT0p/tEi7PPwPsYDwiapXH8jwU+I=
			</data>
		</dict>
		<key>Base.lproj/Main.storyboardc/DetectionVC.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			OWdSj4ULplloA8YR7/NOwoyBsXX8ukc2dNj6JYgl7qE=
			</data>
		</dict>
		<key>Base.lproj/Main.storyboardc/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			deWhPAKdUp2Dis0O7go+AzzG47wbbqlIh1faLM7EDuU=
			</data>
		</dict>
		<key>Base.lproj/Main.storyboardc/t4i-bQ-nop-view-pvH-1D-323.nib</key>
		<dict>
			<key>hash2</key>
			<data>
			XNfu/B7sxEWXIpQQkGTvOFPkH0nBkl7G1NsbJuh3EZc=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			FLkAyi9taVm7X4oSFtv+xBinTeczVrItD9C0+lp8vkw=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			bLveLDw/1dIRMznRbs2lWrcJWyqCyC9A90cyHHQGQ3I=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			IfyxUpCwNyXTG/AGQ0ti6XEzQtZgl/VgZAM13lwCTzY=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			v2DQpaem3PQZEuchuR07MH37YaK17UWEcRYtCq/R7+4=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			PW8oyJ/oS3DLHKh8igf3GAVPwIuES6S7smckoDMiZgs=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			5rqi2FEhGceIwfO8dL7ER7Y2nVUSDOvlOTEWbkJSBms=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			9aX9QtFqIDAnmO9u0wmXm0MAPSMg2fDo6pgxqSdZ+0s=
			</data>
		</dict>
		<key>Facenet62.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
		<key>Headers/LivenessFramework-Swift.h</key>
		<dict>
			<key>hash2</key>
			<data>
			kePgvEcex9gwkwgkr/bTjK4WF4HEGxS6Mel+/9XPEFA=
			</data>
		</dict>
		<key>Headers/LivenessFramework.h</key>
		<dict>
			<key>hash2</key>
			<data>
			zPFFnOO45XqXOB8BLlAwzwHsOybiPru+wRw3S/SYLqE=
			</data>
		</dict>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.abi.json</key>
		<dict>
			<key>hash2</key>
			<data>
			dYU2fvqXckoT/yk55GX0Mb0EA3jRRsPUd3mcSdV3urU=
			</data>
		</dict>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.private.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			g5fwhAvSQedt1aQ8JK9BaFTHTh8ASojYdDAHYsqkHZA=
			</data>
		</dict>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			JcTgQ6EJaLHBpd7SlQW5PDWe/7zW0ESa49vNCnwdsiQ=
			</data>
		</dict>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.swiftinterface</key>
		<dict>
			<key>hash2</key>
			<data>
			g5fwhAvSQedt1aQ8JK9BaFTHTh8ASojYdDAHYsqkHZA=
			</data>
		</dict>
		<key>Modules/LivenessFramework.swiftmodule/x86_64-apple-ios-simulator.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			Xy2h5j2X93RhcO7/Dl09UQXyUlLV/yfycInsKnvfkDo=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			oo5cNd787ylu6fsCdko6badgxuL/yFPtzBKPuCcoLxY=
			</data>
		</dict>
		<key>labels.txt</key>
		<dict>
			<key>hash2</key>
			<data>
			51YV41fFAsEPyBr0PNexlCldALl1ywZztrpGYdaCCyc=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
