{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "top" : "InceptionResnetV1\/Repeat\/block35_1\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat\/block35_1\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_1\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 1
    },
    {
      "top" : "InceptionResnetV1\/Repeat\/block35_2\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat\/block35_2\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_2\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 3
    },
    {
      "top" : "InceptionResnetV1\/Repeat\/block35_3\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat\/block35_3\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_3\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 5
    },
    {
      "top" : "InceptionResnetV1\/Repeat\/block35_4\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat\/block35_4\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_4\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 7
    },
    {
      "top" : "InceptionResnetV1\/Repeat\/block35_5\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat\/block35_5\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_5\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 9
    },
    {
      "top" : "InceptionResnetV1\/Repeat_1\/block17_1\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat_1\/block17_1\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat_1\/block17_1\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 11
    },
    {
      "top" : "InceptionResnetV1\/Repeat_1\/block17_2\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat_1\/block17_2\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat_1\/block17_2\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 13
    },
    {
      "top" : "InceptionResnetV1\/Repeat_1\/block17_3\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat_1\/block17_3\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat_1\/block17_3\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 15
    },
    {
      "top" : "InceptionResnetV1\/Repeat_1\/block17_4\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat_1\/block17_4\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat_1\/block17_4\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 17
    },
    {
      "top" : "InceptionResnetV1\/Repeat_1\/block17_5\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat_1\/block17_5\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat_1\/block17_5\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 19
    },
    {
      "top" : "InceptionResnetV1\/Repeat_1\/block17_6\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat_1\/block17_6\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat_1\/block17_6\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 21
    },
    {
      "top" : "InceptionResnetV1\/Repeat_1\/block17_7\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat_1\/block17_7\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat_1\/block17_7\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 23
    },
    {
      "top" : "InceptionResnetV1\/Repeat_1\/block17_8\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat_1\/block17_8\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat_1\/block17_8\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 25
    },
    {
      "top" : "InceptionResnetV1\/Repeat_1\/block17_9\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat_1\/block17_9\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat_1\/block17_9\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 27
    },
    {
      "top" : "InceptionResnetV1\/Repeat_1\/block17_10\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat_1\/block17_10\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat_1\/block17_10\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 29
    },
    {
      "top" : "InceptionResnetV1\/Repeat_2\/block8_1\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat_2\/block8_1\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat_2\/block8_1\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 31
    },
    {
      "top" : "InceptionResnetV1\/Repeat_2\/block8_2\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat_2\/block8_2\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat_2\/block8_2\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 33
    },
    {
      "top" : "InceptionResnetV1\/Repeat_2\/block8_3\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat_2\/block8_3\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat_2\/block8_3\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 35
    },
    {
      "top" : "InceptionResnetV1\/Repeat_2\/block8_4\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat_2\/block8_4\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat_2\/block8_4\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 37
    },
    {
      "top" : "InceptionResnetV1\/Repeat_2\/block8_5\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Repeat_2\/block8_5\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Repeat_2\/block8_5\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 39
    },
    {
      "top" : "InceptionResnetV1\/Block8\/mul\/x",
      "w" : 1,
      "h" : 1,
      "name" : "InceptionResnetV1\/Block8\/mul\/x",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Block8\/mul\/x",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 41
    },
    {
      "top" : "InceptionResnetV1\/Bottleneck\/BatchNorm\/beta\/read",
      "w" : 512,
      "h" : 1,
      "name" : "InceptionResnetV1\/Bottleneck\/BatchNorm\/beta\/read",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Bottleneck\/BatchNorm\/beta\/read",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 43
    },
    {
      "top" : "InceptionResnetV1\/Bottleneck\/BatchNorm\/moving_mean\/read",
      "w" : 512,
      "h" : 1,
      "name" : "InceptionResnetV1\/Bottleneck\/BatchNorm\/moving_mean\/read",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Bottleneck\/BatchNorm\/moving_mean\/read",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 45
    },
    {
      "top" : "InceptionResnetV1\/Bottleneck\/BatchNorm\/FusedBatchNorm\/Mul",
      "w" : 512,
      "h" : 1,
      "name" : "InceptionResnetV1\/Bottleneck\/BatchNorm\/FusedBatchNorm\/Mul",
      "nd_rank" : 1,
      "type" : "load_constant",
      "k" : 1,
      "bottom" : "",
      "debug_info" : "InceptionResnetV1\/Bottleneck\/BatchNorm\/FusedBatchNorm\/Mul",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 47
    },
    {
      "axis_h" : 2,
      "axis_w" : 1,
      "bottom" : "input",
      "axis_k" : 0,
      "axis_n" : 3,
      "axis_seq" : 4,
      "weights" : {

      },
      "debug_info" : "input_to_nchw",
      "top" : "input_to_nchw",
      "type" : "transpose",
      "name" : "input_to_nchw"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Conv2d_1a_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Conv2d_1a_3x3\/Relu",
      "K" : 3,
      "blob_biases" : 49,
      "stride_x" : 2,
      "name" : "InceptionResnetV1\/Conv2d_1a_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input_to_nchw",
      "weights" : {
        "per_ch_qbias" : 53,
        "per_ch_qscale" : 55,
        "W_U6" : 51
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Conv2d_2a_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Conv2d_2a_3x3\/Relu",
      "K" : 32,
      "blob_biases" : 57,
      "name" : "InceptionResnetV1\/Conv2d_2a_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Conv2d_1a_3x3\/Relu",
      "weights" : {
        "per_ch_qbias" : 61,
        "per_ch_qscale" : 63,
        "W_U6" : 59
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Conv2d_2b_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Conv2d_2b_3x3\/Relu",
      "K" : 32,
      "blob_biases" : 65,
      "name" : "InceptionResnetV1\/Conv2d_2b_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "InceptionResnetV1\/Conv2d_2a_3x3\/Relu",
      "weights" : {
        "per_ch_qbias" : 69,
        "per_ch_qscale" : 71,
        "W_U6" : 67
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "debug_info" : "InceptionResnetV1\/MaxPool_3a_3x3\/MaxPool",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 3,
      "top" : "InceptionResnetV1\/MaxPool_3a_3x3\/MaxPool",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "InceptionResnetV1\/MaxPool_3a_3x3\/MaxPool",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "InceptionResnetV1\/Conv2d_2b_3x3\/Relu",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 3,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Conv2d_3b_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Conv2d_3b_1x1\/Relu",
      "K" : 64,
      "blob_biases" : 73,
      "name" : "InceptionResnetV1\/Conv2d_3b_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "InceptionResnetV1\/MaxPool_3a_3x3\/MaxPool",
      "weights" : {
        "per_ch_qbias" : 77,
        "per_ch_qscale" : 79,
        "W_U6" : 75
      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Conv2d_4a_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Conv2d_4a_3x3\/Relu",
      "K" : 80,
      "blob_biases" : 81,
      "name" : "InceptionResnetV1\/Conv2d_4a_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "InceptionResnetV1\/Conv2d_3b_1x1\/Relu",
      "weights" : {
        "per_ch_qbias" : 85,
        "per_ch_qscale" : 87,
        "W_U6" : 83
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Conv2d_4b_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Conv2d_4b_3x3\/Relu",
      "K" : 192,
      "blob_biases" : 89,
      "stride_x" : 2,
      "name" : "InceptionResnetV1\/Conv2d_4b_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "InceptionResnetV1\/Conv2d_4a_3x3\/Relu",
      "weights" : {
        "per_ch_qbias" : 93,
        "per_ch_qscale" : 95,
        "W_U6" : 91
      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_0\/Conv2d_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_0\/Conv2d_1x1\/Relu",
      "K" : 256,
      "blob_biases" : 97,
      "name" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_0\/Conv2d_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Conv2d_4b_3x3\/Relu",
      "weights" : {
        "per_ch_qbias" : 101,
        "per_ch_qscale" : 103,
        "W_U6" : 99
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_1\/Conv2d_0a_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_1\/Conv2d_0a_1x1\/Relu",
      "K" : 256,
      "blob_biases" : 105,
      "name" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_1\/Conv2d_0a_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Conv2d_4b_3x3\/Relu",
      "weights" : {
        "per_ch_qbias" : 109,
        "per_ch_qscale" : 111,
        "W_U6" : 107
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_2\/Conv2d_0a_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_2\/Conv2d_0a_1x1\/Relu",
      "K" : 256,
      "blob_biases" : 113,
      "name" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_2\/Conv2d_0a_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Conv2d_4b_3x3\/Relu",
      "weights" : {
        "per_ch_qbias" : 117,
        "per_ch_qscale" : 119,
        "W_U6" : 115
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_1\/Conv2d_0b_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_1\/Conv2d_0b_3x3\/Relu",
      "K" : 32,
      "blob_biases" : 121,
      "name" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_1\/Conv2d_0b_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_1\/Conv2d_0a_1x1\/Relu",
      "weights" : {
        "per_ch_qbias" : 125,
        "per_ch_qscale" : 127,
        "W_U6" : 123
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_2\/Conv2d_0b_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_2\/Conv2d_0b_3x3\/Relu",
      "K" : 32,
      "blob_biases" : 129,
      "name" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_2\/Conv2d_0b_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_2\/Conv2d_0a_1x1\/Relu",
      "weights" : {
        "per_ch_qbias" : 133,
        "per_ch_qscale" : 135,
        "W_U6" : 131
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_2\/Conv2d_0c_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_2\/Conv2d_0c_3x3\/Relu",
      "K" : 32,
      "blob_biases" : 137,
      "name" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_2\/Conv2d_0c_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_2\/Conv2d_0b_3x3\/Relu",
      "weights" : {
        "per_ch_qbias" : 141,
        "per_ch_qscale" : 143,
        "W_U6" : 139
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_1\/concat",
      "top" : "InceptionResnetV1\/Repeat\/block35_1\/concat",
      "type" : "concat",
      "name" : "InceptionResnetV1\/Repeat\/block35_1\/concat",
      "bottom" : "InceptionResnetV1\/Repeat\/block35_1\/Branch_0\/Conv2d_1x1\/Relu,InceptionResnetV1\/Repeat\/block35_1\/Branch_1\/Conv2d_0b_3x3\/Relu,InceptionResnetV1\/Repeat\/block35_1\/Branch_2\/Conv2d_0c_3x3\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_1\/Conv2d_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_1\/Conv2d_1x1\/Conv2D",
      "K" : 96,
      "blob_biases" : 145,
      "name" : "InceptionResnetV1\/Repeat\/block35_1\/Conv2d_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_1\/concat",
      "weights" : {
        "per_ch_qbias" : 149,
        "per_ch_qscale" : 151,
        "W_U6" : 147
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "InceptionResnetV1\/Repeat\/block35_1\/mul\/x,InceptionResnetV1\/Repeat\/block35_1\/Conv2d_1x1\/Conv2D",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_1\/mul",
      "nd_mode" : true,
      "top" : "InceptionResnetV1\/Repeat\/block35_1\/mul",
      "type" : "elementwise",
      "name" : "InceptionResnetV1\/Repeat\/block35_1\/mul",
      "beta" : 0
    },
    {
      "bottom" : "InceptionResnetV1\/Conv2d_4b_3x3\/Relu,InceptionResnetV1\/Repeat\/block35_1\/mul",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_1\/add",
      "nd_mode" : true,
      "top" : "InceptionResnetV1\/Repeat\/block35_1\/add",
      "type" : "elementwise",
      "name" : "InceptionResnetV1\/Repeat\/block35_1\/add",
      "beta" : 0
    },
    {
      "bottom" : "InceptionResnetV1\/Repeat\/block35_1\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_1\/Relu",
      "top" : "InceptionResnetV1\/Repeat\/block35_1\/Relu",
      "type" : "activation",
      "name" : "InceptionResnetV1\/Repeat\/block35_1\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_0\/Conv2d_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_0\/Conv2d_1x1\/Relu",
      "K" : 256,
      "blob_biases" : 153,
      "name" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_0\/Conv2d_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_1\/Relu",
      "weights" : {
        "per_ch_qbias" : 157,
        "per_ch_qscale" : 159,
        "W_U6" : 155
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_1\/Conv2d_0a_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_1\/Conv2d_0a_1x1\/Relu",
      "K" : 256,
      "blob_biases" : 161,
      "name" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_1\/Conv2d_0a_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_1\/Relu",
      "weights" : {
        "per_ch_qbias" : 165,
        "per_ch_qscale" : 167,
        "W_U6" : 163
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_2\/Conv2d_0a_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_2\/Conv2d_0a_1x1\/Relu",
      "K" : 256,
      "blob_biases" : 169,
      "name" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_2\/Conv2d_0a_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_1\/Relu",
      "weights" : {
        "per_ch_qbias" : 173,
        "per_ch_qscale" : 175,
        "W_U6" : 171
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_1\/Conv2d_0b_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_1\/Conv2d_0b_3x3\/Relu",
      "K" : 32,
      "blob_biases" : 177,
      "name" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_1\/Conv2d_0b_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_1\/Conv2d_0a_1x1\/Relu",
      "weights" : {
        "per_ch_qbias" : 181,
        "per_ch_qscale" : 183,
        "W_U6" : 179
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_2\/Conv2d_0b_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_2\/Conv2d_0b_3x3\/Relu",
      "K" : 32,
      "blob_biases" : 185,
      "name" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_2\/Conv2d_0b_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_2\/Conv2d_0a_1x1\/Relu",
      "weights" : {
        "per_ch_qbias" : 189,
        "per_ch_qscale" : 191,
        "W_U6" : 187
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_2\/Conv2d_0c_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_2\/Conv2d_0c_3x3\/Relu",
      "K" : 32,
      "blob_biases" : 193,
      "name" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_2\/Conv2d_0c_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_2\/Conv2d_0b_3x3\/Relu",
      "weights" : {
        "per_ch_qbias" : 197,
        "per_ch_qscale" : 199,
        "W_U6" : 195
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_2\/concat",
      "top" : "InceptionResnetV1\/Repeat\/block35_2\/concat",
      "type" : "concat",
      "name" : "InceptionResnetV1\/Repeat\/block35_2\/concat",
      "bottom" : "InceptionResnetV1\/Repeat\/block35_2\/Branch_0\/Conv2d_1x1\/Relu,InceptionResnetV1\/Repeat\/block35_2\/Branch_1\/Conv2d_0b_3x3\/Relu,InceptionResnetV1\/Repeat\/block35_2\/Branch_2\/Conv2d_0c_3x3\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_2\/Conv2d_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_2\/Conv2d_1x1\/Conv2D",
      "K" : 96,
      "blob_biases" : 201,
      "name" : "InceptionResnetV1\/Repeat\/block35_2\/Conv2d_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_2\/concat",
      "weights" : {
        "per_ch_qbias" : 205,
        "per_ch_qscale" : 207,
        "W_U6" : 203
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "InceptionResnetV1\/Repeat\/block35_2\/mul\/x,InceptionResnetV1\/Repeat\/block35_2\/Conv2d_1x1\/Conv2D",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_2\/mul",
      "nd_mode" : true,
      "top" : "InceptionResnetV1\/Repeat\/block35_2\/mul",
      "type" : "elementwise",
      "name" : "InceptionResnetV1\/Repeat\/block35_2\/mul",
      "beta" : 0
    },
    {
      "bottom" : "InceptionResnetV1\/Repeat\/block35_1\/Relu,InceptionResnetV1\/Repeat\/block35_2\/mul",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_2\/add",
      "nd_mode" : true,
      "top" : "InceptionResnetV1\/Repeat\/block35_2\/add",
      "type" : "elementwise",
      "name" : "InceptionResnetV1\/Repeat\/block35_2\/add",
      "beta" : 0
    },
    {
      "bottom" : "InceptionResnetV1\/Repeat\/block35_2\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_2\/Relu",
      "top" : "InceptionResnetV1\/Repeat\/block35_2\/Relu",
      "type" : "activation",
      "name" : "InceptionResnetV1\/Repeat\/block35_2\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_0\/Conv2d_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_0\/Conv2d_1x1\/Relu",
      "K" : 256,
      "blob_biases" : 209,
      "name" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_0\/Conv2d_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_2\/Relu",
      "weights" : {
        "per_ch_qbias" : 213,
        "per_ch_qscale" : 215,
        "W_U6" : 211
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_1\/Conv2d_0a_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_1\/Conv2d_0a_1x1\/Relu",
      "K" : 256,
      "blob_biases" : 217,
      "name" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_1\/Conv2d_0a_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_2\/Relu",
      "weights" : {
        "per_ch_qbias" : 221,
        "per_ch_qscale" : 223,
        "W_U6" : 219
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_2\/Conv2d_0a_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_2\/Conv2d_0a_1x1\/Relu",
      "K" : 256,
      "blob_biases" : 225,
      "name" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_2\/Conv2d_0a_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_2\/Relu",
      "weights" : {
        "per_ch_qbias" : 229,
        "per_ch_qscale" : 231,
        "W_U6" : 227
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_1\/Conv2d_0b_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_1\/Conv2d_0b_3x3\/Relu",
      "K" : 32,
      "blob_biases" : 233,
      "name" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_1\/Conv2d_0b_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_1\/Conv2d_0a_1x1\/Relu",
      "weights" : {
        "per_ch_qbias" : 237,
        "per_ch_qscale" : 239,
        "W_U6" : 235
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_2\/Conv2d_0b_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_2\/Conv2d_0b_3x3\/Relu",
      "K" : 32,
      "blob_biases" : 241,
      "name" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_2\/Conv2d_0b_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_2\/Conv2d_0a_1x1\/Relu",
      "weights" : {
        "per_ch_qbias" : 245,
        "per_ch_qscale" : 247,
        "W_U6" : 243
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_2\/Conv2d_0c_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_2\/Conv2d_0c_3x3\/Relu",
      "K" : 32,
      "blob_biases" : 249,
      "name" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_2\/Conv2d_0c_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_2\/Conv2d_0b_3x3\/Relu",
      "weights" : {
        "per_ch_qbias" : 253,
        "per_ch_qscale" : 255,
        "W_U6" : 251
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_3\/concat",
      "top" : "InceptionResnetV1\/Repeat\/block35_3\/concat",
      "type" : "concat",
      "name" : "InceptionResnetV1\/Repeat\/block35_3\/concat",
      "bottom" : "InceptionResnetV1\/Repeat\/block35_3\/Branch_0\/Conv2d_1x1\/Relu,InceptionResnetV1\/Repeat\/block35_3\/Branch_1\/Conv2d_0b_3x3\/Relu,InceptionResnetV1\/Repeat\/block35_3\/Branch_2\/Conv2d_0c_3x3\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_3\/Conv2d_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_3\/Conv2d_1x1\/Conv2D",
      "K" : 96,
      "blob_biases" : 257,
      "name" : "InceptionResnetV1\/Repeat\/block35_3\/Conv2d_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_3\/concat",
      "weights" : {
        "per_ch_qbias" : 261,
        "per_ch_qscale" : 263,
        "W_U6" : 259
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "InceptionResnetV1\/Repeat\/block35_3\/mul\/x,InceptionResnetV1\/Repeat\/block35_3\/Conv2d_1x1\/Conv2D",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_3\/mul",
      "nd_mode" : true,
      "top" : "InceptionResnetV1\/Repeat\/block35_3\/mul",
      "type" : "elementwise",
      "name" : "InceptionResnetV1\/Repeat\/block35_3\/mul",
      "beta" : 0
    },
    {
      "bottom" : "InceptionResnetV1\/Repeat\/block35_2\/Relu,InceptionResnetV1\/Repeat\/block35_3\/mul",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_3\/add",
      "nd_mode" : true,
      "top" : "InceptionResnetV1\/Repeat\/block35_3\/add",
      "type" : "elementwise",
      "name" : "InceptionResnetV1\/Repeat\/block35_3\/add",
      "beta" : 0
    },
    {
      "bottom" : "InceptionResnetV1\/Repeat\/block35_3\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_3\/Relu",
      "top" : "InceptionResnetV1\/Repeat\/block35_3\/Relu",
      "type" : "activation",
      "name" : "InceptionResnetV1\/Repeat\/block35_3\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_0\/Conv2d_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_0\/Conv2d_1x1\/Relu",
      "K" : 256,
      "blob_biases" : 265,
      "name" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_0\/Conv2d_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_3\/Relu",
      "weights" : {
        "per_ch_qbias" : 269,
        "per_ch_qscale" : 271,
        "W_U6" : 267
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_1\/Conv2d_0a_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_1\/Conv2d_0a_1x1\/Relu",
      "K" : 256,
      "blob_biases" : 273,
      "name" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_1\/Conv2d_0a_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_3\/Relu",
      "weights" : {
        "per_ch_qbias" : 277,
        "per_ch_qscale" : 279,
        "W_U6" : 275
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_2\/Conv2d_0a_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_2\/Conv2d_0a_1x1\/Relu",
      "K" : 256,
      "blob_biases" : 281,
      "name" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_2\/Conv2d_0a_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_3\/Relu",
      "weights" : {
        "per_ch_qbias" : 285,
        "per_ch_qscale" : 287,
        "W_U6" : 283
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_1\/Conv2d_0b_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_1\/Conv2d_0b_3x3\/Relu",
      "K" : 32,
      "blob_biases" : 289,
      "name" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_1\/Conv2d_0b_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_1\/Conv2d_0a_1x1\/Relu",
      "weights" : {
        "per_ch_qbias" : 293,
        "per_ch_qscale" : 295,
        "W_U6" : 291
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_2\/Conv2d_0b_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_2\/Conv2d_0b_3x3\/Relu",
      "K" : 32,
      "blob_biases" : 297,
      "name" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_2\/Conv2d_0b_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_2\/Conv2d_0a_1x1\/Relu",
      "weights" : {
        "per_ch_qbias" : 301,
        "per_ch_qscale" : 303,
        "W_U6" : 299
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_2\/Conv2d_0c_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_2\/Conv2d_0c_3x3\/Relu",
      "K" : 32,
      "blob_biases" : 305,
      "name" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_2\/Conv2d_0c_3x3\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_2\/Conv2d_0b_3x3\/Relu",
      "weights" : {
        "per_ch_qbias" : 309,
        "per_ch_qscale" : 311,
        "W_U6" : 307
      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_4\/concat",
      "top" : "InceptionResnetV1\/Repeat\/block35_4\/concat",
      "type" : "concat",
      "name" : "InceptionResnetV1\/Repeat\/block35_4\/concat",
      "bottom" : "InceptionResnetV1\/Repeat\/block35_4\/Branch_0\/Conv2d_1x1\/Relu,InceptionResnetV1\/Repeat\/block35_4\/Branch_1\/Conv2d_0b_3x3\/Relu,InceptionResnetV1\/Repeat\/block35_4\/Branch_2\/Conv2d_0c_3x3\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_4\/Conv2d_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_4\/Conv2d_1x1\/Conv2D",
      "K" : 96,
      "blob_biases" : 313,
      "name" : "InceptionResnetV1\/Repeat\/block35_4\/Conv2d_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_4\/concat",
      "weights" : {
        "per_ch_qbias" : 317,
        "per_ch_qscale" : 319,
        "W_U6" : 315
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "InceptionResnetV1\/Repeat\/block35_4\/mul\/x,InceptionResnetV1\/Repeat\/block35_4\/Conv2d_1x1\/Conv2D",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_4\/mul",
      "nd_mode" : true,
      "top" : "InceptionResnetV1\/Repeat\/block35_4\/mul",
      "type" : "elementwise",
      "name" : "InceptionResnetV1\/Repeat\/block35_4\/mul",
      "beta" : 0
    },
    {
      "bottom" : "InceptionResnetV1\/Repeat\/block35_3\/Relu,InceptionResnetV1\/Repeat\/block35_4\/mul",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_4\/add",
      "nd_mode" : true,
      "top" : "InceptionResnetV1\/Repeat\/block35_4\/add",
      "type" : "elementwise",
      "name" : "InceptionResnetV1\/Repeat\/block35_4\/add",
      "beta" : 0
    },
    {
      "bottom" : "InceptionResnetV1\/Repeat\/block35_4\/add",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_4\/Relu",
      "top" : "InceptionResnetV1\/Repeat\/block35_4\/Relu",
      "type" : "activation",
      "name" : "InceptionResnetV1\/Repeat\/block35_4\/Relu"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_5\/Branch_0\/Conv2d_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_5\/Branch_0\/Conv2d_1x1\/Relu",
      "K" : 256,
      "blob_biases" : 321,
      "name" : "InceptionResnetV1\/Repeat\/block35_5\/Branch_0\/Conv2d_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_4\/Relu",
      "weights" : {
        "per_ch_qbias" : 325,
        "per_ch_qscale" : 327,
        "W_U6" : 323
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_5\/Branch_1\/Conv2d_0a_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_5\/Branch_1\/Conv2d_0a_1x1\/Relu",
      "K" : 256,
      "blob_biases" : 329,
      "name" : "InceptionResnetV1\/Repeat\/block35_5\/Branch_1\/Conv2d_0a_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_4\/Relu",
      "weights" : {
        "per_ch_qbias" : 333,
        "per_ch_qscale" : 335,
        "W_U6" : 331
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_5\/Branch_2\/Conv2d_0a_1x1\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_5\/Branch_2\/Conv2d_0a_1x1\/Relu",
      "K" : 256,
      "blob_biases" : 337,
      "name" : "InceptionResnetV1\/Repeat\/block35_5\/Branch_2\/Conv2d_0a_1x1\/Conv2D",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "InceptionResnetV1\/Repeat\/block35_4\/Relu",
      "weights" : {
        "per_ch_qbias" : 341,
        "per_ch_qscale" : 343,
        "W_U6" : 339
      },
      "Nx" : 1,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "InceptionResnetV1\/Repeat\/block35_5\/Branch_1\/Conv2d_0b_3x3\/Conv2D",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "InceptionResnetV1\/Repeat\/block35_5\/Branch_1\/Conv2d_0b_3x3\/Relu",
      "K" : 32,
